In [2]:
print('hello world!')

hello world!

In [5]:
#importing packages 
import numpy as np
import pandas as pd

In [49]:
#reading data set
df = pd.read_csv(r'C:\Users\killi\Downloads\HSA06.20221122T131126.csv')

In [50]:
#inspecting data set
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 588 entries, 0 to 587
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Statistic Label  588 non-null    object
 1   Year             588 non-null    int64
 2   Area             588 non-null    object
 3   UNIT             588 non-null    object
 4   VALUE            583 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 23.1+ KB
None

In [51]:
#counting missing values
print(df.isnull().sum())

Statistic Label    0
Year               0
Area               0
UNIT               0
VALUE              5
dtype: int64

In [52]:
#replace missing values and check
print(df.fillna(0).isnull().sum())

Statistic Label    0
Year               0
Area               0
UNIT               0
VALUE              0
dtype: int64

In [53]:
#checking how many rows and columns are in the dataset
df.shape

(588, 5)

In [55]:
#create 2 datasets for new price analysis. One for Dublin and the second for National.
df_Dub_new = df[(df['Statistic Label'].str.contains("New")) &  (df['Area']=="Dublin")].reset_index()
df_Nat_new = df[(df['Statistic Label'].str.contains("New")) &  (df['Area']=="National")].reset_index()

In [56]:
df_Dub_new.head()

   index   Statistic Label  Year    Area  UNIT    VALUE
0      1  New House Prices  1975  Dublin  Euro  13137.0
1      8  New House Prices  1976  Dublin  Euro  15342.0
2     15  New House Prices  1977  Dublin  Euro  19055.0
3     22  New House Prices  1978  Dublin  Euro  25745.0
4     29  New House Prices  1979  Dublin  Euro  32005.0

In [57]:
df_Nat_new.head()

   index   Statistic Label  Year      Area  UNIT    VALUE
0      0  New House Prices  1975  National  Euro  13254.0
1      7  New House Prices  1976  National  Euro  15564.0
2     14  New House Prices  1977  National  Euro  18754.0
3     21  New House Prices  1978  National  Euro  24082.0
4     28  New House Prices  1979  National  Euro  29387.0